{
  "blogs": [
    {
      "title": "Github ve Hatalar",
      "author": "Burak Nejat Songüler",
      "img": "https://miro.medium.com/max/1400/1*SSRjtoQ0H2X3SBPOiJ5rZw.jpeg",
      "category": "Yazılım",
      "content": "Hiç GitHub nedir merak ettiniz mi? Bu makalede size GitHub’ın ne olduğunu ve ne için kullanıldığını öğreteceğiz.\n\nGitHub, yazılım mühendisleri için önemli bir araç olarak kabul edilir ve popülaritesi rakipsizdir. Şu anda 25 milyondan fazla kullanıcıyı barındırmaktadır. Bu, iş akışı ve işbirliği iyileştirmeleri için GitHub’a yönelen çok sayıda profesyonel anlamına gelir.\n\nKısacası GitHub, Git adlı bir sürüm kontrol sistemini (VCS) barındıran bulut tabanlı bir hizmettir. Geliştiricilerin, ilerlemelerini ayrıntılı olarak takip ederken ortak projelerde işbirliği yapmasına ve değişiklikler yapmasına olanak tanır.\n\nGitHub’ın ne olduğunu ve nasıl çalıştığını daha iyi anlamak için daha derine inmemiz gerekiyor. Önce sürüm kontrolü nedir bunu öğrenmeliyiz.\n\nGitHub, çoğunluğu açık kaynaklı projeler olan 100 milyondan fazla fazla depoya ev sahipliği yapıyor. Bu istatistik, GitHub’ın en popüler Git GUI istemcileri arasında olduğunu ve çeşitli profesyoneller ve Hostinger gibi büyük işletmeler tarafından kullanıldığını gösteriyor.\n\nBunun nedeni GitHub’ın, Git’in sürüm kontrol özelliklerini içeren bulut tabanlı bir proje yönetimi ve organizasyon platformu olmasıdır. Yani, tüm GitHub kullanıcıları, kendilerine sunulan diğer Git işlevlerine aynı yerden erişirken, kaynak kodda yapılan değişiklikleri gerçek zamanlı olarak izleyebilir ve yönetebilir.\n\nDahası, GitHub’ın kullanıcı arayüzü Git’ten daha kullanıcı dostudur ve çok az teknik bilgiye sahip olan veya hiç olmayan kişiler için erişilebilir hale getirir. Bu, bir projenin ilerlemesine ve yönetimine daha fazla ekip üyesinin dahil edilebileceği ve geliştirme sürecini daha sorunsuz hale getirebileceği anlamına gelir.",
      "date": "2022-12-2-15:34:43",
      "id": 6
    },
    {
      "title": "Nişanlanmak",
      "author": "Erdem Altun",
      "img": "https://www.ahmetekin.com/wp-content/uploads/2021/07/nisanlanma-hukuku.jpg",
      "category": "Hayat",
      "content": "Nişanlanma, ancak evlenme vaadiyle olur. Evlenme vaadi bulunmadığı takdirde, tarafların iradeleri nişanlanmayı doğurmaz. Evlenme vaadinin herhangi bir şekli bulunmamaktadır. Yazılı ya da sözlü olarak ortaya konulabilir. Gelenek görenekçe düzenlenmiş şekil unsurlarına uyulmaması nişanlanmayı sakatlamaz, geçersiz kılmaz. Ancak Yargıtay 3. Hukuk Dairesi bir kararında(1) nişanlanmada yasaca şekil şartı konulmadığını belirttikten sonra “Nişanın hukuken geçerli olması için belli bir rituel içinde yapılmış olması, nişanın duyurulması(ilan edilmesi) ve aile bireylerinin şahitliği çerçevesinde yapılması gerekmektedir.“, demek suretiyle nişanlanmada şekil şartı bulunduğunu, aile içerisinde bir merasimin gerçekleşmesinin mecburi olduğunu ortaya koymuştur. Kanaatimiz, daire kararının yerinde olmadığı yönündedir. Zira, yasanın merasimi gerekli görmemesi bir yana, toplumun kabul ettiği belirli bir ritüel de nişanlanma için bulunmamaktadır. Nişanın duyurulması söz konusu olmadığı gibi nişanın aile bireylerinin şahitliğinde yapılması gerekliliği adetlerde dahi yer almamaktadır. Kaldı ki yasa 18 yaşını doldurmuş kişiye hiç kimseden izin almadan evlenme izni verirken, aynı kişinin nişanlanmak için ailesini bir araya getirmesini ve dolayısıyla kişinin ailesinden izin almasını beklemek yerinde olmayacaktır. Bu karar ancak nişanlanmanın ispatı için yol gösterici olabilir.\nTaraf iradelerinin açıklanmasında temsil söz konusu değildir. Şahsa sıkı sıkıya bağlı bir hak olması nedeniyle temsilci aracılığıyla nişanlanma gerçekleşemez. Taraflar, nişanlanmaya yönelik iradelerini, bizzat açıklamak zorundadırlar.\nNişanlanma, yasal temsilcilerinin rızası olmadıkça küçüğü veya kısıtlıyı bağlamaz. Bağlamaz ifadesinden anlaşılması gereken, nişanlanmanın maddi yönüdür. Buna göre nişanlanma yaşı olarak belirlenebilecek bir yaş ya da yaş sınırı yoktur. Ancak tarafların nişanlanmanın hukuki sonuçlarını anlayabilecek seviyede ayırt etme gücüne sahip olmaları gereklidir. Aksi halde tarafların nişanlanma ehliyeti mevcut olmayacaktır.\nNişanlılıkta süre yoktur. Her ne kadar taraflar aralarında evlenmek için gün belirleyebiliyor olsalar da, nişanlılığın geçerli olacağı süre belirlenemez. Süreli nişanlılığın ya da belli bir süreden sonra evlenileceğine yönelik beyanların hukuki karşılığı bulunmamaktadır.\nNişanlılık, evlenmeye zorlamak için dava hakkı vermez(TMK md. 119/1). Nişanlılık mutlaka evlilik ile sonuçlanmak zorunda değildir. Taraflar diledikleri an nişanlanmaya yönelik beyanlarından vazgeçebilirler. Taraflar birbirlerini, nişanlı olmayı dayanak göstererek evliliğe zorlayamazlar.\nHer ne kadar evlilik yükümlülüğü sağlamasa da nişanlanma, taraflara sadakat yükü yükler. Bu sadakat yüküne aksi davranaşlar, ilgili tarafın kusurlu sayılması sonucunu ortaya koyar.\nNişanlılığın önemli bir sonucu da, nişanlıların birbirleri aleyhinde tanıklık yapmaktan kaçınabilecek olmalarıdır. Çünkü nişanlılar, kanun önünde birbirlerinin yakınıdırlar.",
      "date": "2022-12-2-15:20:14",
      "id": 7
    },
    {
      "title": "Basketbolda Hızlı Hücum",
      "author": "Okan Reşit Maden",
      "img": "https://www.abcspor.com/wp-content/uploads/2015/06/LEBRON-1907.png",
      "category": "Spor",
      "content": "Basketbolda en az set hücumu kadar önemli olan bir hücum çeşidi de hızlı hücumlar yani fast breaklerdir. Hızlı hücumlar sırasında rakibinizi eksik yakaladığınız için devamlı avantajlısınızdır. Hızlı hücum sayesinde kolay sayı bulabilir,rakibinizin moralini bozabilir ve rakibinizi hataya zorlayabilirsiniz. Bunlar hızlı hücumun mükemmel olan avantajlarındandır\n\nHızlı hücumun belli başlı temelleri vardır. Bunlar;savunma ribaundunu alıp topu doğru bir şekilde çizgiye yakın koşan oyunculara aktarmak,doğru ve isabetli pas verme,doğru saha dizilişi ve doğru bitiriş.Bunlardan biri eksik olursa hızlı hücum başarısız olabilir.\n\nHızlı hücumun nasıl yapıldığına gelirsek... Öncelikle savunma ribaundu mutlaka alınmalı.Savunma ribaundu alındıktan sonra öndeki kısa oyuncular kenarlara doğru açılmalı,koşmaya başlamalı ve elini kaldırarak top istemelidir .Ribaundu alan oyuncuda bu koşan oyunculardan hangisi boşta ise bunlara tam isabet bir pas atmalıdır.Pas koşan oyuncunun ne çok önüne ne de çok arkasına düşmelidir.Tam topu kontrol edebileceği bir yere atılmalıdır.Pas atıldıktan sonra ilerideki koşan oyunculardan topu alan içeriye doğru mümkün olduğunca az top sürerek boşsa kendi, değilse diğer kenardan koşan arkadaşına topu indirmelidir.İ şte bu kadar.\n\nHızlı hücum kolay bir şey değildir.Oyuncuların mutlaka ve mutlaka antrenmanlarda 1'e 1, 2'e 1, 3'e 1, 3'e 2 gibi varyasyonlarla çalışmalar yapması ve doğru bir şekilde hücum yapmayı öğrenmesi gerekir.",
      "date": "2022-12-3-5:3:10",
      "id": 8
    },
    {
      "title": "Geforce NOW",
      "author": "Varol Maksutoğlu",
      "img": "https://www.technopat.net/wp-content/uploads/2021/01/GeForce-NOW-Nedir-Sikca-Sorulan-Sorular-748x420.jpg",
      "category": "Teknoloji",
      "content": "İnternet hızlarının artması ile birlikte yavaş yavaş oyunları bilgisayarımıza indirme gereksinimi ortadan kalkmaya başlıyor. Bu tür bir hizmet bundan yıllar önce OnLive isiminde ortaya çıkmış fakat başarısızlıkla sonuçlanmıştı. Bulut oyun servislerinin 2020 gibi hayatımıza gireceğini bundan 5 sene önce belirtmiştik ki 2020 gerçekten de söz konusu servislerin coştuğu bir yıl oldu. GeForce Now, Google Stadia ve Xbox Cloud Gaming gibi hizmetler 2020’de çıkışlarını yaptılar. İçlerinde şu anda en popüler olan ise NVIDIA’nnı hizmeti GeForce NOW. Peki bulut oyun servisi tam olarak nedir ve nasıl çalışır? İşte GeForce NOW hakkında bilmeniz gereken her şey.\n\nGeForce NOW nedir?\nGeForce NOW, NVIDIA’nın bulut tabanlı oyun akış servisidir. GeForce NOW dizüstü bilgisayarınıza, masaüstü bilgisayarınıza, Mac’inize, SHIELD TV’nize ve Android cihazınıza bulut üzerinden doğrudan gerçek zamanlı oyun deneyimi sunar. Oyun hesaplarınıza bağlanıp ister kütüphanenizdeki oyunları, ister ücretsiz oyunları dilediğiniz gibi oynayabilir, bulut kayıtlarıyla da (desteklenen oyunlar için), nerede olursanız olun, destekleyen herhangi bir cihazdan kaldığınız yerden devam edebilirsiniz.\n\nGeForce NOW nerelerde kullanılabilir?\nGeForce NOW şu anda sadece Kuzey Amerika ve Avrupa’da mevcut. Kullanılabilir sunucuların tam listesi ve durumları için sunucu durumu sayfasını ziyaret edebilirsiniz.\n\nGeForce NOW hangi ülkelerde kullanılabilir?\nGeForce NOW şu anda Türkiye dahil 80’den fazla ülkede kullanılabilir durumda. Desteklenen ülkelerin listesi için bu makaleyi ziyaret edebilirsiniz.\n\nGeForce NOW’a nasıl katılabilirim? Fiyatı nedir?\nGeForce NOW iki üyelik seçeneği sunuyor; Ücretsiz ve Founders. Üyelik sayfasını ziyaret edip tercih ettiğiniz bir üyelik türünü seçebilirsiniz. Founders üyeliği şu anda 6 aylık 27.45€ ki bu da aylık 4,575€’ya denk geliyor.\n\nStandart erişim ile öncelikli erişim arasındaki fark nedir?\nÜcretsiz üyeler GeForce NOW sunucularına standart erişime sahipken, Founders üyeleri öncelikli erişim hakkına sahip olur. Sunucunun yoğunluğuna bağlı olarak üyeler bekleme süreleri yaşayabilir. Öncelikli erişime sahip Founders üyeleri, bir oyuna başlarken sıranın en önüne yerleştirilir ve bekleme süreleri kısalır. Standart erişime sahip ücretsiz üyelikler ise sunucu kullanılabilirliğine bağlı olarak kuyrukta daha uzun bekleme süreleri yaşayabilir.\n\nUzatılmış oturum süresi ne anlama geliyor?\nFounders üyeleri, her biri altı saate kadar süren uzatılmış oturum süresi (extended session lengths) alır. Mevcut oturumun süresi dolduktan sonra, oyuna devam edebilmek için tekrar sıraya geçer ve öne yerleştirilir. Bu yeni seansların herhangi bir sınırı yoktur.",
      "date": "2022-12-2 / 15:37:33",
      "id": 9
    },
    {
      "title": "Penaltı Nasıl Kullanılmalı?",
      "author": "Kaan Sefer Maden",
      "img": "https://img.piri.net/mnresize/900/-/resim/imagecrop/2019/05/28/01/59/resized_ef84b-4fb108b7worldcuppenaltykicke1530625847706.jpg",
      "category": "Spor",
      "content": "Maçlarda hakem penaltı noktasını gösterdiği an herkeste bir heyecan başlar. Atışı kullanacak oyuncu topun başına geldiğinde nasıl bir penaltı kullanacağı ile ilgili pek düşünmeyiz.Aklımızdaki tek soru gol olup olmayacağıdır.Ancak oyuncuların her zaman bir stratejisi vardır. Peki nedir bu stratejiler?\n\nPenaltı atışında penaltıyı kullanan futbolcu için 2 strateji vardır. Birincisi kaleciye göre atıştır. Bu stratejide atışı kullanan oyuncu topa hareketlenirken kalecinin atlayışını takip ederek atış yönünü belirler ve kalecinin seçtiği yönün tersine vuruş yapmaya çalışır. İkincisi ise kaleciden bağımsız atıştır. Bu stratejide atışı kullanan oyuncu vuruşu yapacağı bölgeyi topa hareketlenmeden önce belirler. İkinci yöntemde atış yönü belirlenir ve kaleciye odaklanmaksızın vuruş o yöne yapılır(Kuhn).\n\nKaleciye göre atış stratejisi penaltıyı kullanan oyuncuya atış kararını değiştirmek için çok kısa bir süre verir. Yapılan bir çalışmada yarı profesyonel oyuncuların atış kararlarını değiştirmek için en az 400-600 milisaniyeye ihtiyaç duydukları görülmüştür (Navarro). Eğer kaleci atıştan 500 milisaniye önce atlayışı yaparsa atışı kullanan oyuncu karar vermekte gecikerek istediği vuruşu yapamayacaktır. Yapılan başka bir çalışmada penaltı atışlarında başarılı kalecilerin atış anından yaklaşık 250 milisaniye önce hareket ettikleri görülmüştür(Dicks, Button, & Davids).\n\nBu iki farklı yöntem de literatürde kullanılmasına rağmen sahada yaygınlığı ve başarı yüzdeleri henüz netleştirilememiştir.\n\nNoel ve arkadaşları ‘’Futbolda penaltı atış stratejilerini tanımlama metodu geliştirmek’’ başlıklı çalışmalarında 42 penaltı atışını dikkat,aldatma,topa geliş,vuruş hızı,atış öncesi topa uzaklık,vuruş öncesi son adım uzunluğu, atışa hazırlık süresi,atışta kaleciye bakma süresi,atışta topa bakma süresi, vuruş yönü tahmin edilebilirliği, oyucunun kendine güveni, vuruş tekniği(ayak üstü, dışı, içi) gibi değişkenlere göre incelemiş ve bunların iki farklı penaltı stratejisi için (kaleciye göre ve kaleciden bağımsız) belirleyiciliklerini incelemişler.\n\nYapılan bu çalışmada kaleciden bağımsız atış kullananlarda topa geliş hızı, vuruş hızı, son adım uzunluğu ve topa bakış süresi değerleri yüksek görülmüş. Kaleciye göre atış kullananlarda ise kaleciye dikkat, aldatma, hazırlık süresi ve hedefe bakış süresi değerleri yüksek görülmüş.\n\nÇalışma kapsamında atış stratejilerini belirleyen değerler tanımlandıktan sonra 1986-2010 arası Dünya Kupaları ve 1984-2012 arası UEFA Şampiyonalarında kullanılan penaltıların görüntüleri analiz edilerek iki farklı strateji karşılaştırılmış.\n\nÇalışma sonunda atılan penaltıların %82’si kaleciden bağımsız, %18’i kaleciye göre atış olarak görülmüş.",
      "date": "2022-12-2 / 15:39:1",
      "id": 10
    },
    {
      "title": "TRT Nedir?",
      "author": "Enes Söl",
      "img": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/6d/TRT_logo_%282018-%29.svg/1200px-TRT_logo_%282018-%29.svg.png",
      "category": "Medya",
      "content": "Türkiye Radyo Televizyon Kurumu (TRT), 1 Mayıs 1964 tarihinde çıkarılan TRT yasasıyla kurulan ve Türkiye'nin kamu yayıncılığı yapmakla görevli ilk ve tek kuruluşudur. TRT aynı zamanda Türkiye’den Avrupa Yayın Birliği (EBU)’ne tam üye olan ilk ve tek yayıncıdır.\n\nTürkiye'de yayın yapan ikinci televizyon kanalıdır. 1952'de yayına başlayan ve sadece İstanbul'da yayın yapan İTÜ TV'nin 1970 yılında kapanmasından sonra TRT, 1990'ların başında ilk özel televizyon ve radyo kanalı yayına başlayana dek Türkiye'de radyo ve televizyon yayıncılığı yapan tek kurum olarak hizmet vermiş; ülkede televizyon ve radyo yayıncılığı konusunda ilk örnekleri oluşturmuştur. 1968 ve 1986 yılları arasında Türkiye'de yayın yapan tek televizyon kanalı TRT'nin yayımladığı TRT 1 kanalı olmuş; 1986 yılında TRT 2 yayına girmiştir.\nİlk programlı radyo yayınına 1965 yılında geçildi ve bütün radyolar haber saatlerinde TRT Ankara Radyosu'na bağlandılar. Aynı yıl bünyesinde Türk Sanat Müziği ve Türk Halk Müziği Danışma Kurulu ve Klasik Batı Müziği ve Çağdaş Türk Müziği Danışma Kurulu toplandılar. Seçim sonuçlarını vermek için ilk sabaha kadar yayın yine bu yıl yapıldı. 1966 yılında TRT kapalı devre televizyon eğitimi yayınları başladı. Spor haberleri ilk kez 1967 yılında haber bülteni ile birlikte verildi. TRT Erzurum Radyosu ve TRT İzmir Radyosu yine bu yıl içerisinde yayın hayatlarına başladı. Televizyon yayınına yönelik çalışmalara hız verildi.",
      "date": "2022-12-2 / 15:40:5",
      "id": 11
    },
    {
      "title": "Ankara Yemekleri",
      "author": "Halil Enes Özdemir",
      "img": "https://www.camhotel.com.tr/uploads/images/ankara_tava_yemegi.jpg",
      "category": "Yemek",
      "content": "Ankara yemekleri söz konusu olduğunda gerek lezzeti gerekse doyuruculuğu ile gönülleri fetheden Ankara Tava’yı liste başında incelemek gerekir. En az 1 gün dinlendirilmiş kol ya da kaburga etinden hazırlanan etlerin bol tereyağlı pilav ile birleşimi olarak zihninizde canlandırabileceğiniz yemeği kavurarak ya da fırınlayarak yapabilmek mümkün. \n\nAnkara Tava yemeğini hazırlamak, ne yazık ki bir çırpıda anlatmak kadar kolay değil. Sabır ve emek isteyen Ankara Tava, özel bakır tavasında piştiğinde ise özen isteyen her şey kadar güzel bir lezzete kavuşuyor. Bu nedenle genellikle düğün, kermes gibi özel günlerde Ankara Tava yemeği yapılıyor. Tek başına yeterince leziz olan yemeğin yanında hoşaf, cacık gibi tamamlayıcılar olduğunda ise ortaya yemeye kıyılamayacak kadar mükemmel bir menü çıkıyor.\n\nBici Aşı\nÜlkemizde asma yaprağından yapılan her tür yemek büyük bir keyifle tüketiliyor. Eğer siz de asma yaprağını seviyorsanız Ankara’ya gelip de Bici Aşı’nı yemeden dönmemelisiniz. Taze asma yapraklarının bulgur ile birlikteliği olarak tanımlayabileceğimiz Bici Aşı yemeğini bir de üzerine sarımsaklı yoğurt gezdirerek denerseniz asla pişman olmazsınız. \n\nHem faydalı hem de lezzetli bu yemeği Ankara’nın birçok noktasında bulabilirsiniz. Özellikle esnaf lokantalarında en çok rağbet gören yemeklerden biri olan Bici Aşı’nın geleneksel bir tat olmakla birlikte Ankara dışında henüz çok bilinen bir lezzet olmadığını söyleyebiliriz.\n\nAdı Ankara şehri ile özdeşleşen yaprak döneri diğer şehirlerde bulabileceğiniz dönerden ayıran nokta, adeta bir yaprak inceliğinde açılan koyun etinin sinir ve liflerinin ayıklanarak özenle ezilen domateslerle birlikte tepsiye dizilerek terbiye edilmesidir. Bu şekilde 1 gün boyunca bekleyen etler, aralarına kuyruk yerleştirilerek şişe takılır ve ardından kömür ateşinde ağır ağır döndürülerek pişirilir.\n\nBu haliyle bile yeterince muhteşem olan Ankara Yaprak Döneri’nin yanında bir de ona eşlik edecek yoğurt olduğunda tadına doyum olmaz. Ankara’nın birçok yerinde bulabileceğiniz köklü geçmişe sahip yaprak dönercilerde başkentin en güzel yemeklerinden birini tatma fırsatı yakalayabilirsiniz.",
      "date": "2022-12-3-5:4:29",
      "id": 12
    }
  ]
}